In [1]:
#Import Required packages
import mysql.connector
from mysql.connector import Error
import pandas as pd

In [2]:
#Connect to MySQL
connection = mysql.connector.connect(host='cpanel.insaid.co',
                                     database='Capstone1',
                                         user='student',
                                         password='student')
if connection.is_connected():
    db_Info = connection.get_server_info()
    print("Connected to MySQL Server version ", db_Info)
    cursor = connection.cursor()
    cursor.execute("select database();")
    record = cursor.fetchone()
    print("You're connected to database: ", record)

Connected to MySQL Server version  5.6.46-cll-lve
You're connected to database:  ('Capstone1',)

In [3]:
#Fetching data from MySQL
cursor.execute("select * from gender_age_train")
data1=cursor.fetchall()
cursor.execute("select * from phone_brand_device_model")
data2=cursor.fetchall()

In [4]:
#Converting to DataFrame
gender_age_train=pd.DataFrame(data1)
gender_age_train.columns=['device_id','gender','age','age_group']
phone_brand_device_model=pd.DataFrame(data2)
phone_brand_device_model.columns=['device_id','brand','model']

In [5]:
#Viewing data of gender_age_train
gender_age_train.head()

             device_id gender  age age_group
0 -8076087639492063270      M   35    M32-38
1 -2897161552818060146      M   35    M32-38
2 -8260683887967679142      M   35    M32-38
3 -4938849341048082022      M   30    M29-31
4   245133531816851882      M   30    M29-31

In [6]:
#Viewing data of phone_brand_device_model
phone_brand_device_model.head()

             device_id brand    model
0  1877775838486905855  vivo      Y13
1 -3766087376657242966    小米     V183
2 -6238937574958215831  OPPO      R7s
3  8973197758510677470    三星    A368t
4 -2015528097870762664    小米  红米Note2

In [7]:
#Read data from events_data
events_data=pd.read_csv("events_data.csv")
events_data.head()

,event_id,device_id,timestamp,longitude,latitude,city,state
0,1.0,2.918269e+16,2016-05-01 00:55:25,77.266049,28.68161,Delhi,Delhi
1,7104.0,2.918269e+16,2016-05-02 09:37:02,77.266049,28.68161,Delhi,Delhi
2,29661.0,2.918269e+16,2016-05-04 00:56:04,77.266049,28.68161,Delhi,Delhi
3,33133.0,2.918269e+16,2016-05-06 05:01:15,77.266049,28.68161,Delhi,Delhi
4,38980.0,2.918269e+16,2016-05-06 09:55:04,77.266049,28.68161,Delhi,Delhi

In [8]:
#Getting Number of observations in each dataset
print(gender_age_train.shape)
print(phone_brand_device_model.shape)
print(events_data.shape)

(74645, 4)
(87726, 3)
(3252950, 7)

In [9]:
#Checking Null values in Event_Data
events_data.isnull().sum()

event_id       0
device_id    453
timestamp      0
longitude    423
latitude     423
city           0
state        377
dtype: int64

In [10]:
#Sort Event_Data for forward filling the missing states fields
events_data.sort_values(by=['state','city'],inplace=True)

In [11]:
#forward filling the missing states fields
events_data['state']=events_data['state'].ffill(axis=0)

In [12]:
#Filling Missing values of latitude by Average in that city
events_data['latitude']=events_data['latitude'].fillna(events_data.groupby('city')['latitude'].transform('mean'))

In [13]:
##Filling Missing values pf longitude by Average in that city
events_data['longitude']=events_data['longitude'].fillna(events_data.groupby('city')['longitude'].transform('mean'))

In [14]:
#Checking NULL values after replacing them
events_data.isnull().sum()

event_id       0
device_id    453
timestamp      0
longitude      0
latitude       0
city           0
state          0
dtype: int64

In [15]:
#Checking Null values in gender_age_train
gender_age_train.isnull().sum()

device_id    0
gender       0
age          0
age_group    0
dtype: int64

In [16]:
#Checking Null values in phone_brand_device_model
phone_brand_device_model.isnull().sum()

device_id    0
brand        0
model        0
dtype: int64